content/20240606_r_metaprogramming.org
#+title: R Metaprogramming - Misc Patterns
#+author: Eric Neer
#+date: 2024-06-09
#+tags: R rlang metaprogramming
#+doctype: post
#+property: header-args :exports both :eval never-export :mkdirp t 
#+property: header-args:R :dir /docker:r_meta:/home/ :session *R-r_meta* :results output

* R Metaprogramming - Misc Patterns

This is a miscellaneous collection of metaprogramming examples I've used in
production code.

** Set up a docker container to run R code in 

#+begin_src dockerfile :tangle 20240606_r_metaprogramming_misc_patterns/Dockerfile
  FROM rocker/rstudio:latest
  # rocker/tidyverse didn't seem to have a prebuilt arm64 image, so
  # we can build our own
  RUN Rscript -e "install.packages(c('rlang', 'tidyverse', 'lobstr'))"
#+end_src

#+begin_src shell :dir (concat default-directory "20240606_r_metaprongramming_misc_patterns/")
  docker build . -t r_meta:latest
#+end_src

#+begin_src shell :dir ~/
  docker run --rm --name r_meta -dti r_meta
#+end_src

#+RESULTS:
: bba8f0404662ee369f8b4cce781a8c797016922e1a16e6eed826641840962ca4

** Preliminaries

~rlang~ provides a nice wrapper over base R's metaprogramming capabilities and
extends it with a few useful facilities.

#+begin_src R :results none
  library(rlang)
#+end_src

*** Expressions and expression lists

R code (aka ~language~ objects) can be created, inspected, and modified much the
same as any other object in R. To prevent code from being evaluated, it must be
"quoted" which base R accomplishes with the ~quote~ function. rlang accomplishes
this with the ~expr~ function, short for "expression".

#+begin_src R
  (two_expr <- expr(1 + 1))
  class(two_expr)
  is.language(two_expr)
#+end_src

#+RESULTS:
: 1 + 1
: [1] "call"
: [1] TRUE

Expression lists are unsurprisingly lists of expressions, easily made by ~exprs~.

#+begin_src R
  exprs(
    x + 5,
    unevaluated_call(y),
    z
  )
#+end_src

#+RESULTS:
: [[1]]
: x + 5
: 
: [[2]]
: unevaluated_call(y)
: 
: [[3]]
: z

*** Partial evaluation

Code evaluation need not be all or nothing, however. Sometimes it is useful to
only partially evaluate an expression, which in R is usually referred to as
"quasiquotation", sometimes "backquote". In base R, this is accomplished with
the ~bquote~ function, which will accept part of an expression wrapped in ~.()~
to force evaluation.

#+begin_src R
  numerator <- 5
  bquote(.(numerator) / denominator)
#+end_src

#+RESULTS:
: 5/denominator

rlang uses the "bang-bang" operator ~!!~

#+begin_src R
  expr(!!numerator / denominator)
#+end_src

#+RESULTS:
: 5/denominator

** Patterns / Examples
*** ~filter~ Expressions
Sometimes it may be useful to store filters in a variable such that they may be
reused or be set as the result of some computation or argument to a
function. For functions that support "tidy dots", expression lists may be
"spliced" in to the function call, essentially unpacking the list (powered by
~rlang::list2~). This is useful in applying multiple filter conditions.

  #+begin_src R
    my_filters <- exprs(
      cyl == 6,
      mpg >= 20
    )

    # filter supports tidy dots
    dplyr::filter(mtcars, !!!my_filters) |> knitr::kable()
  #+end_src

  #+RESULTS:
  : 
  : 
  : |               |  mpg| cyl| disp|  hp| drat|    wt|  qsec| vs| am| gear| carb|
  : |:--------------|----:|---:|----:|---:|----:|-----:|-----:|--:|--:|----:|----:|
  : |Mazda RX4      | 21.0|   6|  160| 110| 3.90| 2.620| 16.46|  0|  1|    4|    4|
  : |Mazda RX4 Wag  | 21.0|   6|  160| 110| 3.90| 2.875| 17.02|  0|  1|    4|    4|
  : |Hornet 4 Drive | 21.4|   6|  258| 110| 3.08| 3.215| 19.44|  1|  0|    3|    1|
  
