content/20240606_r_metaprogramming.org
*** Creating/Modifying Variables in a ~mutate~

Very similarly to filtering expressions, mutations can be encoded in expressions
with one added complication. Often when using ~mutate~, we want to name the
result of a computation (i.e. we give the new column a name). If we know the
resulting name, this is fairly straightforward:

#+begin_src R
  times_two <- function(x) {
    x * 2
  }

  mutations <- exprs(
    mpg = times_two(mpg),
    hp = times_two(mpg)
  )

  dplyr::transmute(head(mtcars), !!!mutations) |> knitr::kable()
#+end_src

#+RESULTS:
#+begin_example


|                  |  mpg|   hp|
|:-----------------|----:|----:|
|Mazda RX4         | 42.0| 84.0|
|Mazda RX4 Wag     | 42.0| 84.0|
|Datsun 710        | 45.6| 91.2|
|Hornet 4 Drive    | 42.8| 85.6|
|Hornet Sportabout | 37.4| 74.8|
|Valiant           | 36.2| 72.4|
#+end_example

We run in to issues, however, if we don't know the resulting name (i.e. we want
the name of the column to also be a variable):

#+begin_src R
  times_two_expression <- function(var) {
    exprs(!!var = times_two(!!var))
  }

  times_two_expression(cyl)
#+end_src

#+RESULTS:
: Error: unexpected '=' in:
: "times_two_expression <- function(var) {
:   exprs(!!var ="
: Error: unexpected '}' in "}"
: Error: object 'cyl' not found

As the errors say, we can't have a variable on the left hand side of an
assignment. Additionally, since the name ~cyl~ doesn't exist outside of
~mtcars~, an error is thrown when trying to use it. To address these, we can use
the fact that the walrus operator ~:=~ allows variables on the LHS of an
assignment. However, it only allows strings on the LHS. So this will work:

#+begin_src R
  times_two_expression <- function(var) {
    exprs(!!var := times_two(!!sym(var)))
  }

  times_two_expression("cyl")

  dplyr::transmute(head(mtcars), !!!times_two_expression("cyl"))  |> knitr::kable()
#+end_src

#+RESULTS:
#+begin_example
$cyl
times_two(cyl)


|                  | cyl|
|:-----------------|---:|
|Mazda RX4         |  12|
|Mazda RX4 Wag     |  12|
|Datsun 710        |   8|
|Hornet 4 Drive    |  12|
|Hornet Sportabout |  16|
|Valiant           |  12|
#+end_example

This only works if we expect a string argument for ~var~. Alternatively, we
could expect symbols as arguments and adjust appropriately:

#+begin_src R
  times_two_expression <- function(var) {
    exprs(!!as_name(var) := times_two(!!var))
  }

  times_two_expression(expr(cyl))

  dplyr::transmute(head(mtcars), !!!times_two_expression(expr(cyl))) |> knitr::kable()
#+end_src

#+RESULTS:
#+begin_example
$cyl
times_two(cyl)


|                  | cyl|
|:-----------------|---:|
|Mazda RX4         |  12|
|Mazda RX4 Wag     |  12|
|Datsun 710        |   8|
|Hornet 4 Drive    |  12|
|Hornet Sportabout |  16|
|Valiant           |  12|
#+end_example

I prefer to use a ~exprs~ list that uses symbols inside expressions and set the
list names (as strings) to handle the naming. This avoids having to worry about
strings inside our expressions:

#+begin_src R
  columns_to_double <- exprs(cyl, mpg, hp)

  times_two_expression <- function(var) {
    ## using expr now (i.e. this doesn't return a list, but an
    ## expression now)
    expr(times_two(!!var))
  }

  (my_exprs <- set_names(
    ## list of expressions
    purrr::map(columns_to_double, times_two_expression),
    ## character vector of names
    purrr::map_chr(columns_to_double, as_name)
  ))

  dplyr::transmute(head(mtcars), !!!my_exprs) |> knitr::kable()
#+end_src

#+RESULTS:
#+begin_example
$cyl
times_two(cyl)

$mpg
times_two(mpg)

$hp
times_two(hp)


|                  | cyl|  mpg|  hp|
|:-----------------|---:|----:|---:|
|Mazda RX4         |  12| 42.0| 220|
|Mazda RX4 Wag     |  12| 42.0| 220|
|Datsun 710        |   8| 45.6| 186|
|Hornet 4 Drive    |  12| 42.8| 220|
|Hornet Sportabout |  16| 37.4| 350|
|Valiant           |  12| 36.2| 210|
#+end_example

*** Chaining Expressions with a Pipe

Usually when working with lists of expressions, we need to combine them
somehow. A pattern I've often used is to build up a list of expressions that
form the steps in a pipeline. To turn the list into one expression I put all
elements together with a pipe, which is easy enough with ~purrr::reduce~.

#+begin_src R :results output
  pipe_together <- function(x, y) {
    expr(!!x %>% !!y)
  }

  purrr::reduce(
    exprs(
      mtcars,
      dplyr::filter(!!!my_filters),
      dplyr::transmute(!!!my_exprs)
    ),
    pipe_together
  )
#+end_src

#+RESULTS:
: mtcars %>% dplyr::filter(cyl == 6, mpg >= 20) %>% dplyr::transmute(cyl = times_two(cyl), 
:     mpg = times_two(mpg), hp = times_two(hp))

