public/20240606_r_metaprogramming.html
<div id="outline-container-org05556bc" class="outline-4">
<h4 id="org05556bc">Creating/Modifying Variables in a <code>mutate</code></h4>
<div class="outline-text-4" id="text-org05556bc">
<p>
Very similarly to filtering expressions, mutations can be encoded in expressions
with one added complication. Often when using <code>mutate</code>, we want to name the
result of a computation (i.e. we give the new column a name). If we know the
resulting name, this is fairly straightforward:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">times_two</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(x) {
  x * 2
}

mutations <span style="color: #0000b0;">&lt;-</span> exprs(
  mpg = times_two(mpg),
  hp = times_two(mpg)
)

dplyr::transmute(head(mtcars), !!!mutations) |&gt; knitr::kable()
</pre>
</div>

<pre class="example" id="org514c6fa">


|                  |  mpg|   hp|
|:-----------------|----:|----:|
|Mazda RX4         | 42.0| 84.0|
|Mazda RX4 Wag     | 42.0| 84.0|
|Datsun 710        | 45.6| 91.2|
|Hornet 4 Drive    | 42.8| 85.6|
|Hornet Sportabout | 37.4| 74.8|
|Valiant           | 36.2| 72.4|
</pre>

<p>
We run in to issues, however, if we don't know the resulting name (i.e. we want
the name of the column to also be a variable):
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">times_two_expression</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(var) {
  exprs(!!var = times_two(!!var))
}

times_two_expression(cyl)
</pre>
</div>

<pre class="example">
Error: unexpected '=' in:
"times_two_expression &lt;- function(var) {
  exprs(!!var ="
Error: unexpected '}' in "}"
Error: object 'cyl' not found
</pre>


<p>
As the errors say, we can't have a variable on the left hand side of an
assignment. Additionally, since the name <code>cyl</code> doesn't exist outside of
<code>mtcars</code>, an error is thrown when trying to use it. To address these, we can use
the fact that the walrus operator <code>:=</code> allows variables on the LHS of an
assignment. However, it only allows strings on the LHS. So this will work:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">times_two_expression</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(var) {
  exprs(!!var := times_two(!!sym(var)))
}

times_two_expression(<span style="color: #3548cf;">"cyl"</span>)

dplyr::transmute(head(mtcars), !!!times_two_expression(<span style="color: #3548cf;">"cyl"</span>))  |&gt; knitr::kable()
</pre>
</div>

<pre class="example" id="org55f369f">
$cyl
times_two(cyl)


|                  | cyl|
|:-----------------|---:|
|Mazda RX4         |  12|
|Mazda RX4 Wag     |  12|
|Datsun 710        |   8|
|Hornet 4 Drive    |  12|
|Hornet Sportabout |  16|
|Valiant           |  12|
</pre>

<p>
This only works if we expect a string argument for <code>var</code>. Alternatively, we
could expect symbols as arguments and adjust appropriately:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">times_two_expression</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(var) {
  exprs(!!as_name(var) := times_two(!!var))
}

times_two_expression(expr(cyl))

dplyr::transmute(head(mtcars), !!!times_two_expression(expr(cyl))) |&gt; knitr::kable()
</pre>
</div>

<pre class="example" id="orge41e2ab">
$cyl
times_two(cyl)


|                  | cyl|
|:-----------------|---:|
|Mazda RX4         |  12|
|Mazda RX4 Wag     |  12|
|Datsun 710        |   8|
|Hornet 4 Drive    |  12|
|Hornet Sportabout |  16|
|Valiant           |  12|
</pre>

<p>
I prefer to use a <code>exprs</code> list that uses symbols inside expressions and set the
list names (as strings) to handle the naming. This avoids having to worry about
strings inside our expressions:
</p>

<div class="org-src-container">
<pre class="src src-R">columns_to_double <span style="color: #0000b0;">&lt;-</span> exprs(cyl, mpg, hp)

<span style="color: #721045;">times_two_expression</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(var) {
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">using expr now (i.e. this doesn't return a list, but an</span>
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">expression now)</span>
  expr(times_two(!!var))
}

(my_exprs <span style="color: #0000b0;">&lt;-</span> set_names(
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">list of expressions</span>
  purrr::map(columns_to_double, times_two_expression),
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">character vector of names</span>
  purrr::map_chr(columns_to_double, as_name)
))

dplyr::transmute(head(mtcars), !!!my_exprs) |&gt; knitr::kable()
</pre>
</div>

<pre class="example" id="org9596988">
$cyl
times_two(cyl)

$mpg
times_two(mpg)

$hp
times_two(hp)


|                  | cyl|  mpg|  hp|
|:-----------------|---:|----:|---:|
|Mazda RX4         |  12| 42.0| 220|
|Mazda RX4 Wag     |  12| 42.0| 220|
|Datsun 710        |   8| 45.6| 186|
|Hornet 4 Drive    |  12| 42.8| 220|
|Hornet Sportabout |  16| 37.4| 350|
|Valiant           |  12| 36.2| 210|
</pre>
</div>
</div>
<div id="outline-container-org9b815cb" class="outline-4">
<h4 id="org9b815cb">Chaining Expressions with a Pipe</h4>
<div class="outline-text-4" id="text-org9b815cb">
<p>
Usually when working with lists of expressions, we need to combine them
somehow. A pattern I've often used is to build up a list of expressions that
form the steps in a pipeline. To turn the list into one expression I put all
elements together with a pipe, which is easy enough with <code>purrr::reduce</code>.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">pipe_together</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(x, y) {
  expr(!!x <span style="color: #0000b0;">%&gt;%</span> !!y)
}

purrr::reduce(
  exprs(
    mtcars,
    dplyr::filter(!!!my_filters),
    dplyr::transmute(!!!my_exprs)
  ),
  pipe_together
)
</pre>
</div>

<pre class="example">
mtcars %&gt;% dplyr::filter(cyl == 6, mpg &gt;= 20) %&gt;% dplyr::transmute(cyl = times_two(cyl), 
    mpg = times_two(mpg), hp = times_two(hp))
</pre>
</div>
</div>
