content/20240606_r_metaprogramming.org
*** Dynamic modification of functions

I once had a project that was essentially a data pipeline with many steps that
needed to run in a specific order due to dependencies between steps (i.e. it had
to solve a DAG). The python Hamilton library encodes DAGs by having functions
whose arguments were named the same as a function whose result should be used in
place of that argument. With function and argument names defining the DAG, some
introspection of functions allowed one to build the DAG out. That introspection
is straightforward with R.

Here's some functions that use function and argument names to define the DAG as
described above.

#+begin_src R :results none
  mtcars_data <- function(cyls) mtcars[mtcars$cyl %in% cyls, ]

  horsepower <- function(mtcars_data) mtcars_data$hp

  weight <- function(mtcars_data) mtcars_data$wt

  power_to_weight <- function(horsepower, weight) horsepower / weight
#+end_src

To actually solve the connections between functions, we can recurse through
functions and their arguments, putting calls to those functions in a new child
environment and returning that child environment.

#+begin_src R :results none
  solve_dataflow <- function(fun_name, envir = rlang::caller_env()) {
    ## setup a child environment in which we can define how to call
    ## functions (with the parent env defining those functions)
    env_plan <- new_environment(parent = envir)

    ## we need to be able to tell if a given name corresponds to a
    ## function we know about
    is_function <- function(name) {
      name %in% lsf.str(envir)
    }

    ## get previously defined function names from our environment to be used as
    ## argument to dependent functions
    formals_from_plan <- function(formals_names) {
      if (!is.null(formals_names)) {
        env_get_list(env_plan, formals_names)
      } else {
        list()
      }
    }

    ## we need to recurse (starting from function `fun_name`) down all the
    ## function arguments, replacing argument names with calls to corresponding
    ## functions (if so defined)
    recur <- function(sym_name) {
      if (is_function(sym_name)) {
        formals_names <- fn_fmls_names(as_function(sym_name, envir))

        # arguments to this function that aren't in the planning environment
        unresolved <- setdiff(formals_names, env_names(env_plan))

        # make sure all arguments are resolved to a call or symbol
        purrr::walk(unresolved, recur)

        ## "install" in the env_plan environment a name whose value is how to call
        ## the function corresponding to that name
        env_bind(
          env_plan,
          !!sym_name := call2(sym_name, !!!formals_from_plan(formals_names))
        )
      } else {
        # its just a symbol
        env_bind(env_plan, !!sym_name := sym(sym_name))
      }
    }
    recur(fun_name)

    ## return the new environment
    env_plan
  }
#+end_src

"Solving" the DAG makes the connections between functions and arguments. Note
how function names have been replace by calls to those functions, and its
arguments replaced with calls to calculate that function argument.

#+begin_src R
  execution_plan <- solve_dataflow("power_to_weight")
  lobstr::tree(execution_plan)
#+end_src

#+RESULTS:
: <environment: 0xaaab03b3ef40>
: ├─weight: <language> weight(mtcars_data = mtcars_data(cyls = cyls))
: ├─power_to_weight: <language> power_to_weight(horsepower = horsepower(mtcars_data = mtcars_data(cyls = cyls)), power_to_weight: <language>     weight = weight(mtcars_data = mtcars_data(cyls = cyls)))
: ├─cyls: <symbol> cyls
: ├─horsepower: <language> horsepower(mtcars_data = mtcars_data(cyls = cyls))
: └─mtcars_data: <language> mtcars_data(cyls = cyls)

Viewing the AST of function calls demonstrates the order in which function calls
will happen (with █ indicating a function call).

#+begin_src R
  lobstr::ast(!!execution_plan$power_to_weight)
#+end_src

#+RESULTS:
: █─power_to_weight 
: ├─horsepower = █─horsepower 
: │              └─mtcars_data = █─mtcars_data 
: │                              └─cyls = cyls 
: └─weight = █─weight 
:            └─mtcars_data = █─mtcars_data 
:                            └─cyls = cyls

Note that since none of these functions are defined in the ~execution_plan~
environment, their actual implementations will be looked up in the parent of
~execution_plan~.

~eval~ ing the tree of calls enables a final calculation, defining any
symbols that aren't function calls (e.g. ~cyls~ here).

#+begin_src R
  eval(execution_plan$power_to_weight, list(cyls = 4))
#+end_src

#+RESULTS:
:  [1] 40.08621 19.43574 30.15873 30.00000 32.19814 35.42234 39.35091 34.10853 42.52336 74.68605 39.20863
  
** Shut down docker container

#+begin_src shell :dir ~/
  docker stop r_meta
#+end_src

#+RESULTS:
: r_meta
