public/20240606_r_metaprogramming.html
<div id="outline-container-org5695383" class="outline-4">
<h4 id="org5695383">Dynamic modification of functions</h4>
<div class="outline-text-4" id="text-org5695383">
<p>
I once had a project that was essentially a data pipeline with many steps that
needed to run in a specific order due to dependencies between steps (i.e. it had
to solve a DAG). The python Hamilton library encodes DAGs by having functions
whose arguments were named the same as a function whose result should be used in
place of that argument. With function and argument names defining the DAG, some
introspection of functions allowed one to build the DAG out. That introspection
is straightforward with R.
</p>

<p>
Here's some functions that use function and argument names to define the DAG as
described above.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">mtcars_data</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(cyls) mtcars[mtcars$cyl <span style="color: #0000b0;">%in%</span> cyls, ]

<span style="color: #721045;">horsepower</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(mtcars_data) mtcars_data$hp

<span style="color: #721045;">weight</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(mtcars_data) mtcars_data$wt

<span style="color: #721045;">power_to_weight</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(horsepower, weight) horsepower / weight
</pre>
</div>

<p>
To actually solve the connections between functions, we can recurse through
functions and their arguments, putting calls to those functions in a new child
environment and returning that child environment.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #721045;">solve_dataflow</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(fun_name, envir = rlang::caller_env()) {
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">setup a child environment in which we can define how to call</span>
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">functions (with the parent env defining those functions)</span>
  env_plan <span style="color: #0000b0;">&lt;-</span> new_environment(parent = envir)

  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">we need to be able to tell if a given name corresponds to a</span>
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">function we know about</span>
  <span style="color: #721045;">is_function</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(name) {
    name <span style="color: #0000b0;">%in%</span> lsf.str(envir)
  }

  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">get previously defined function names from our environment to be used as</span>
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">argument to dependent functions</span>
  <span style="color: #721045;">formals_from_plan</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(formals_names) {
    <span style="color: #531ab6;">if</span> (!is.null(formals_names)) {
      env_get_list(env_plan, formals_names)
    } <span style="color: #531ab6;">else</span> {
      list()
    }
  }

  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">we need to recurse (starting from function `fun_name`) down all the</span>
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">function arguments, replacing argument names with calls to corresponding</span>
  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">functions (if so defined)</span>
  <span style="color: #721045;">recur</span> <span style="color: #0000b0;">&lt;-</span> <span style="color: #531ab6;">function</span>(sym_name) {
    <span style="color: #531ab6;">if</span> (is_function(sym_name)) {
      formals_names <span style="color: #0000b0;">&lt;-</span> fn_fmls_names(as_function(sym_name, envir))

      <span style="color: #7f0000;"># </span><span style="color: #7f0000;">arguments to this function that aren't in the planning environment</span>
      unresolved <span style="color: #0000b0;">&lt;-</span> setdiff(formals_names, env_names(env_plan))

      <span style="color: #7f0000;"># </span><span style="color: #7f0000;">make sure all arguments are resolved to a call or symbol</span>
      purrr::walk(unresolved, recur)

      <span style="color: #7f0000;">## </span><span style="color: #7f0000;">"install" in the env_plan environment a name whose value is how to call</span>
      <span style="color: #7f0000;">## </span><span style="color: #7f0000;">the function corresponding to that name</span>
      env_bind(
        env_plan,
        !!sym_name := call2(sym_name, !!!formals_from_plan(formals_names))
      )
    } <span style="color: #531ab6;">else</span> {
      <span style="color: #7f0000;"># </span><span style="color: #7f0000;">its just a symbol</span>
      env_bind(env_plan, !!sym_name := sym(sym_name))
    }
  }
  recur(fun_name)

  <span style="color: #7f0000;">## </span><span style="color: #7f0000;">return the new environment</span>
  env_plan
}
</pre>
</div>

<p>
"Solving" the DAG makes the connections between functions and arguments. Note
how function names have been replace by calls to those functions, and its
arguments replaced with calls to calculate that function argument.
</p>

<div class="org-src-container">
<pre class="src src-R">execution_plan <span style="color: #0000b0;">&lt;-</span> solve_dataflow(<span style="color: #3548cf;">"power_to_weight"</span>)
lobstr::tree(execution_plan)
</pre>
</div>

<pre class="example">
&lt;environment: 0xaaab03b3ef40&gt;
├─weight: &lt;language&gt; weight(mtcars_data = mtcars_data(cyls = cyls))
├─power_to_weight: &lt;language&gt; power_to_weight(horsepower = horsepower(mtcars_data = mtcars_data(cyls = cyls)), power_to_weight: &lt;language&gt;     weight = weight(mtcars_data = mtcars_data(cyls = cyls)))
├─cyls: &lt;symbol&gt; cyls
├─horsepower: &lt;language&gt; horsepower(mtcars_data = mtcars_data(cyls = cyls))
└─mtcars_data: &lt;language&gt; mtcars_data(cyls = cyls)
</pre>


<p>
Viewing the AST of function calls demonstrates the order in which function calls
will happen (with █ indicating a function call).
</p>

<div class="org-src-container">
<pre class="src src-R">lobstr::ast(!!execution_plan$power_to_weight)
</pre>
</div>

<pre class="example">
█─power_to_weight 
├─horsepower = █─horsepower 
│              └─mtcars_data = █─mtcars_data 
│                              └─cyls = cyls 
└─weight = █─weight 
           └─mtcars_data = █─mtcars_data 
                           └─cyls = cyls
</pre>


<p>
Note that since none of these functions are defined in the <code>execution_plan</code>
environment, their actual implementations will be looked up in the parent of
<code>execution_plan</code>.
</p>

<p>
<code>eval~ing the tree of calls enables a final calculation, defining any symbols
that aren't function calls (e.g. ~cyls</code> here).
</p>

<div class="org-src-container">
<pre class="src src-R">eval(execution_plan$power_to_weight, list(cyls = 4))
</pre>
</div>

<pre class="example">
[1] 40.08621 19.43574 30.15873 30.00000 32.19814 35.42234 39.35091 34.10853 42.52336 74.68605 39.20863
</pre>
</div>
</div>
</div>
<div id="outline-container-orga4507ab" class="outline-3">
<h3 id="orga4507ab">Shut down docker container</h3>
<div class="outline-text-3" id="text-orga4507ab">
<div class="org-src-container">
<pre class="src src-shell">docker stop r_meta
</pre>
</div>

<pre class="example">
r_meta
</pre>
</div>
</div>
</div>
</div></div></body></html>
